testcase/sphere/constant/kernel/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   12; // [g/mol]
    }

    transport
    {
        kappa   0.552;    // [W/m/K]
    }

    thermodynamics
    {
        Hf      0;
        Cv      3987;    // [J/kg/K]
        Cp      3987;
    }

    equationOfState
    {
        rho     420;   // [kg/m^3]
    }
}

// ************************************************************************* //
