testcase/sphere/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1000000;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1000000;
    }
    oulet
    {
        type            calculated;
        value           uniform 1000000;
    }
    fixedWalls
    {
        type            empty;
    }
    fluid_to_kernel
    {
        type            calculated;
        value           uniform 1000000;
    }


    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
