testcase/sphere/0/fluid/AIR
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      AIR;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.98;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    oulet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      uniform 0;
    }

    fixedWalls
    {
        type            empty;
    }

    fluid_to_kernel
    {
        type            fixedGradient;
        value           uniform 0;
        gradient        uniform 0;
    }
}
