testcase/sphere/0/fluid/H2O
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.01;
    }

    oulet
    {
        type            inletOutlet;
        value           uniform 0.01;
        inletValue      uniform 0.01;
    }

    fixedWalls
    {
        type            empty;
    }

    fluid_to_kernel
    {
        type            fixedGradient;
        gradient        uniform 0.0;
    }
}