testcase/sphere/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 420;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    oulet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    fixedWalls
    {
        type            empty;
    }

    fluid_to_kernel
    {
        type            massTransferCoupled;
        kappaMethod     fluidThermo;
        specie          H2O;
        Tvap            371;
        sourceTerm      HSource;
        Tnbr            T;
        solidCoeff      Ds;
        thickness       uniform 0;
        carrierMolWeight 29.8;
        Length          0.001;
        Sherwood        0.7;
        liquid
        {
            H2O
            {
                defaultCoeffs yes;
            }
        }
        value           $internalField;
    }
}


// ************************************************************************* //
