testcase/sphere/0/kernel/H2O
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.76;

boundaryField
{
    kernel_to_fluid
    {
        type            fixedGradient;
        value           uniform 0;
        gradient        uniform 0;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}