testcase/sphere/0/nSurfaceLayers
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nSurfaceLayers;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
95707
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    oulet
    {
        type            fixedValue;
        value           uniform 0;
    }
    fixedWalls
    {
        type            empty;
    }
    kernel
    {
        type            fixedValue;
        value           nonuniform List<scalar> 0();
    }
    kernel_to_fluid
    {
        type            fixedValue;
        value           nonuniform List<scalar> 0();
    }
    fluid_to_kernel
    {
        type            fixedValue;
        value           nonuniform List<scalar> 0();
    }
}


// ************************************************************************* //
