testcase/sphere/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system/fluid";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.05;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }
    p_rghFinal
    {
        $p_rgh;
        smoother        GaussSeidel;
        relTol          0;
    }

    "rho.*"
    {
        $p_rgh;
        tolerance       1e-05;
        relTol          0;
    }
    
    

    "(U|h|k|epsilon|R)"
    {
        solver      PBiCGStab;
        preconditioner DILU;
        tolerance   1e-7;
        relTol      0.1;
        minIter     3;
    }
	
	"(U|h|k|epsilon|R)Final"
    {
        $U
        tolerance   1e-7;
        relTol      0;
    }
    Yi
    {
        $hFinal;
    }
    H2O
    {
        $U;
    }

    H2OFinal
    {
        $U;
        relTol          0;
    }
	
}

PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    20;
    nCorrectors     2;
    nNonOrthogonalCorrectors    0;
    turbOnFinalIterOnly     false;
    outerCorrectorResidualControl
    {
      //H2O 
      //{
    //    tolerance 1e-2;
    //    relTol    0.0;
      //}
      h
      {
          tolerance 1e-5;
          relTol    0.0;
      }
      Ux
      {
          tolerance 1e-5;
          relTol    0.0;
      }
          Uy
          {
                  tolerance     1e-5;
                  relTol        0.0;
          }
      k
      {
          tolerance 1e-4;
          relTol    0.0;
      }
      omega
      {
          tolerance 1e-4;
          relTol    0.0;
      }
      p_rgh
      {
          tolerance 5e-5;
          relTol    0.0;
      }
    }


}

relaxationFactors
{
    files
    {
        p_rgh                   0.7;
        p_rghFinal              1.0;
    }
    equations
    {
        ".*"                    1.0;
    }
    /*
    equations
    {
        "U(x|y|z)"              0.7;
        "U"                     0.7;
        "UFinal"                1.0;
        "U(x|y|z)Final"         1.0;
        "H2O"                   0.5;
        "H2OFinal"              1.0;
        "h"                     0.5;
        "k|epsilon|G|omega"     0.25;
        "(k|epsilon|h|G|omega)Final"    1.0;
   }*/
}


// ************************************************************************* //
